{"keras_version": "2.1.6", "config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "activation": "relu", "batch_input_shape": [null, 128, 128, 1], "filters": 8, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "filters": 16, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_5", "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_6", "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_7", "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_1", "units": 64, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_2", "units": 6, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}